---
kind: property
id: P:Autodesk.Revit.DB.ContourSettingItem.SubCategoryId
source: html/2c7e4a5b-52d2-b2e3-f575-de87d6c6b2c2.htm
---
# Autodesk.Revit.DB.ContourSettingItem.SubCategoryId Property

The contour line style subcategory id.

## Syntax (C#)
```csharp
public ElementId SubCategoryId { get; }
```